#ifndef _STRUCT_PARA_H_
#define _STRUCT_PARA_H_

#include "datatype.h"

#if 0
INT8S *pPARA_SetupInfo_DSPSVX_gb[] =
{
	"X轴原点设定值(使用绝对编码器)",	// 0
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"X轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择[Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择[Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"X轴正向软限位坐标(线性轴最小输入单位)",	// 117
	"X轴负向软限位坐标(线性轴最小输入单位)",	// 118
	"X轴原点设定值(使用绝对编码器)",	// 119	
};

INT8S *pPARA_SetupInfo_DSPSVY_gb[] =
{
	"Y轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"Y轴原点设定值(使用绝对编码器)",	// 0
	"从站地址",		// 1
	"Y轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"Y轴正向软限位坐标(线性轴最小输入单位)",	// 117
	"Y轴负向软限位坐标(线性轴最小输入单位)",	// 118
	"Y轴原点设定值(使用绝对编码器)",	// 119		
};

INT8S *pPARA_SetupInfo_DSPSVZ_gb[] =
{
	"Z轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"Z轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"Z轴正向软限位坐标(线性轴最小输入单位)",	// 117
	"Z轴负向软限位坐标(线性轴最小输入单位)",	// 118
	"Z轴原点设定值(使用绝对编码器)",	// 119	
};

INT8S *pPARA_SetupInfo_DSPSVIV_gb[] =
{
	"IV轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"IV轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"IV轴正向软限位坐标(旋转轴最小输入单位)",	// 117
	"IV轴负向软限位坐标(旋转轴最小输入单位)",	// 118
	"IV轴原点设定值(使用绝对编码器)",	// 119
};

INT8S *pPARA_SetupInfo_DSPSVV_gb[] =
{
	"V轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"V轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"V轴正向软限位坐标(旋转轴最小输入单位)",	// 117
	"V轴负向软限位坐标(旋转轴最小输入单位)",	// 118
	"V轴原点设定值(使用绝对编码器)",	// 119	
};

INT8S *pPARA_SetupInfo_DSPSVVI_gb[] =
{
	"VI轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"VI轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"VI轴正向软限位坐标(旋转轴最小输入单位)",	// 117
	"VI轴负向软限位坐标(旋转轴最小输入单位)",	// 118
	"VI轴原点设定值(使用绝对编码器)",	// 119
};

INT8S *pPARA_SetupInfo_DSPSVVII_gb[] =
{
	"VII轴原点设定值(使用绝对编码器)",	// 119	
	//"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"VII轴伺服电机马达旋转方向设置[Pn000.0]",			// 2
	"伺服功能选择1:第1陷波器功能选择[Pn408.0]",		// 3
	"伺服功能选择2:速度限制选择[Pn408.1]",				// 4
	"伺服功能选择3:第2陷波器功能选择[Pn408.2]",		// 5
	"伺服功能选择4:摩擦补正功能选择[Pn408.3]",			// 6
	"伺服功能选择5:增益类控制选择 [Pn10B.0]",			// 7
	"伺服功能选择6:增益切换功能选择[Pn139.0]",			// 8
	"伺服功能选择7:增益切换条件设置[Pn139.1]",			// 9
	"伺服功能选择8:模型跟踪控制选择[Pn140.0]",			// 10
	"伺服功能选择9:模型跟踪控制类型选择[Pn14F.0]",	// 11
	"伺服功能选择10:振动抑制选择 [Pn140.1]",				// 12
	"伺服功能选择11:振动抑制功能调整选择[Pn140.2]",	// 13
	"伺服功能选择12:A型抑振控制选择[Pn160.0]",				// 14
	"伺服功能选择13:A型抑振控制调整选择[Pn160.1]",		// 15
	"伺服功能选择14:振动检出开关[Pn310.0]",					// 16
	"伺服功能选择15:免调整类开关[Pn170.0]",					// 17
	"伺服功能选择16:免调整类型选择[Pn14F.1]",				// 18
	"伺服功能选择17:速度环控制方法选择[Pn10B.1]",							// 19
	"伺服功能选择18:速度前馈/转矩前馈选择[Pn140.3]",	// 20
	"伺服功能选择19:编码器使用方法选择[Pn002]",			// 21
	"伺服功能选择20:位置分配开关[Pn81F.0]",						// 22
	"伺服功能选择21:位置指令滤波器开关[Pn82A.1]",						// 23
	"伺服功能选择22:位置指令滤波器类型选择[Pn82A.0]",		// 24
	"伺服功能选择23:增益切换开关[Pn82A.3]",									// 25
	"伺服功能选择24:增益切换类型选择[Pn82A.2]",			// 26
	"伺服功能选择25:输入信号P-OT信号分配[Pn50A.0]",		// 27
	"伺服功能选择26:输入信号N-OT信号分配[Pn50B.0]",		// 28
	"伺服功能选择27:输出信号BK信号分配[Pn50F.2]",		// 29
	"速度环增益",					// 30
	"速度环积分时间常数",		// 31
	"位置环增益",					// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"第2速度环增益",					// 49
	"第2速度环积分时间常数",		// 50
	"第2位置环增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",		// 100
	"平均移动时间",		// 101
	"攻牙(位置模式)速度环增益",				// 102
	"攻牙(位置模式)速度环积分时间常数",	// 103
	"攻牙(位置模式)位置环增益",	// 104
	"编码器线数",	// 105
	"电机一转对应直线距离(nm)或旋转角度(nd)",	// 106
	"减速比分子(带减速箱)",	// 107
	"减速比分母(带减速箱)",	// 108
	"速度控制减速时间[0~10000](单位:ms)",	// 109	
	"未定义",	// 110
	"固定监视选择1[PnB0E]",	// 111
	"固定监视选择2[PnB10]",	// 112
	"选项监控1[Pn824]",	// 113
	"选项监控2[Pn825]",	// 114
	"电机编码器分辨率(单位:pulse)",	// 115
	"电机最高转速(单位:r/min)",		// 116
	"VII轴正向软限位坐标(旋转轴最小输入单位)",	// 117
	"VII轴负向软限位坐标(旋转轴最小输入单位)",	// 118
	"VII轴原点设定值(使用绝对编码器)",	// 119
};


INT8S *pPARA_SetupInfo_DSPSVS_gb[] =
{
	"总线类型选择(0-关闭;1-M2 ;2-M3; 3-Sercos; 4-EtherCAT)",	// 0
	"从站地址",		// 1
	"S轴伺服电机马达旋转方向设置(通过0或1切换)",	// 2
	"第1陷波器选择(0-无效;1-有效)",						// 3
	"速度限制选择(0-最高速度;1-设定限制速度)",		// 4
	"第2陷波器选择(0-无效;1-有效)",						// 5
	"摩擦补正功能选择(0-无效;1-有效)",					// 6
	"增益类模式开关选择条件(0-转矩;1-速度;2-加速度;3-位置偏差;4-无效)",		// 7
	"增益选择切换开关(0-手动;2-自动)",						// 8
	"增益切换条件(0-COIN ON;1-COIN OFF;2-NEAR ON;3:NEAR OFF)",		// 9
	"模型跟踪控制选择开关(0-无效;1-有效)",				// 10
	"模型跟踪控制类型选择(0-控制1型;1-控制2型)",		// 11
	"振动抑制选择(0-无效;1-特定频率;2-指定2种频率)",	// 12
	"振动抑制功能调整选择(0-无效;1-有效)",	// 13
	"A型抑振控制选择(0-无效;1-有效)",				// 14
	"A型抑振控制调整选择(0-无效;1-有效)",		// 15
	"振动检出开关(0-无效;1-有效)",					// 16
	"伺服主轴伺服使能开关(0-无效;1-同步电机;2-异步电机)",		// 17
	"免调整类型选择(0-免调整1型;1-免调整2型)",				// 18
	"速度环控制方法(0-PI控制;1-IP控制)",							// 19
	"速度前馈/转矩前馈选择(0-同时使用;1-不同时使用)",	// 20
	"外部编码器使用方法(0-不使用;1-正方向; 3-反方向)",	// 21
	"选择件位置分配开关(0-无效;1-有效)",						// 22
	"位置指令滤波器开关(0-无效;1-有效)",						// 23
	"位置指令滤波器(0-无效;1-指数函数;2-移动平均)",		// 24
	"增益切换开关(0-无效;1-有效)",									// 25
	"增益切换(0-增益一;1-增益二;2-增益三;4-增益四)",			// 26
	"输入信号P-OT信号分配",			// 27
	"输入信号N-OT信号分配",			// 28
	"输出信号BK信号分配",			// 29
	"伺服主轴速度环通常增益",	// 30
	"伺服主轴速度环积分时间常数",		// 31
	"伺服主轴位置环通常增益",			// 32
	"转动惯量比",					// 33
	"前馈",							// 34
	"前馈滤波器时间常数",		// 35
	"PG分频比(脉冲单位)",			// 36
	"电子齿轮比(分子)",			// 37
	"电子齿轮比(分母)",			// 38
	"位置指令加减速时间参数",				// 39
	"第1段第1转矩指令滤波器时间常数",	// 40
	"第1段陷波滤波器频率",		// 41
	"第1段陷波滤波器Q值",		// 42
	"第2段陷波滤波器频率",		// 43
	"第2段陷波滤波器Q值",		// 44
	"位置偏差过大警报值",		// 45
	"定位完成宽度",				// 46
	"第2段转矩指令滤波器频率",	// 47
	"第2段转矩指令滤波器Q值",		// 48
	"伺服主轴速度环换刀增益",	// 49
	"伺服主轴速度环换刀积分时间常数",		// 50
	"伺服主轴位置环换刀增益",					// 51
	"增益类应用开关转矩指令设定值",			// 52
	"增益类应用开关速度指令设定值 ",			// 53
	"增益类应用开关加速度指令设定值",		// 54
	"增益类应用开关位置偏差指令设定值",	// 55
	"摩擦补正增益",			// 56
	"第2摩擦补正增益",		// 57
	"摩擦补正系数",			// 58
	"摩擦补正频率补正 ",		// 59
	"摩擦补正增益补正",		// 60
	"增益切换时间1",			// 61
	"增益切换时间2",			// 62
	"增益切换等待时间1 ",	// 63
	"增益切换等待时间2 ",	// 64
	"电流增益值",				// 65
	"模型追踪控制增益 ",		// 66
	"模型追踪控制增益补正",			// 67
	"模型追踪正转方向控制偏置",		// 68
	"模型追踪反转方向控制偏置",		// 69
	"模型追踪控制速度前馈补正",		// 70
	"第2模型追踪控制增益",				// 71
	"第2模型追踪控制增益补正",		// 72
	"振动抑制1频率A",		// 73
	"振动抑制1频率B",		// 74
	"振动抑制2频率A",		// 75
	"振动抑制2频率B",		// 76
	"A型抑振频率",			// 77
	"A型抑振增益补正",	// 78
	"A型抑振阻尼增益",	// 79
	"A型抑振滤波时间常数1补正",		// 80
	"A型抑振滤波时间常数2补正",		// 81
	"振动检出灵敏度",		// 82
	"振动检出值",				// 83
	"免调整调谐值",			// 84
	"免调整负载值",			// 85
	"转矩控制时的速度限制",			// 86
	"制动器指令-伺服OFF延迟时间",	// 87
	"制动器指令输出速度值",			// 88
	"伺服OFF -制动器指令等待时间",	// 89
	"瞬时停电保持时间",		// 90
	"外部编码器节距值",		// 91
	"再生电阻容量",			// 92
	"第1段直线加速参数",	// 93
	"第2段直线加速参数",	// 94
	"加速参数切换速度",		// 95
	"第1段直线减速参数",	// 96
	"第2段直线减速参数",	// 97
	"减速参数切换速度",		// 98
	"指数函数加减速偏置",	// 99
	"指数函数加减速时间参数",				// 100
	"平均移动时间",								// 101
	"伺服主轴速度环攻牙增益",				// 102
	"伺服主轴速度环攻牙积分时间常数",	// 103
	"伺服主轴位置环攻牙增益",				// 104
	"未定义",			// 105
	"",	// 106
	"",	// 107
	"",	// 108
	"",	// 109	
	"",	// 110
	"",	// 111
	"",	// 112
	"",	// 113
	"",	// 114
	"",	// 115
	"",	// 116
	"",	// 117
	"",	// 118
	"",	// 119		
};

INT8S *pPARA_SetupInfo_DSPPP_gb[] =
{
	"转角不减速最大角度[0~30](单位:度)",	// 0
	"转向过程时间常数(单位:ms)",				// 1
	"切削加工最大钳制速度(单位:mm/min)",	// 2
	"通用加速时间常数(单位:0.1ms)",			// 3
	"通用减速时间常数(单位:0.1ms)",			// 4
	"转角指定加速度[1~50000](单位: mm/s2)",	// 5
	"短区域长度值[1~100000](单位:um)",			// 6
	"短区域加减速度值[1~50000](单位:mm/s2)",			// 7
	"X轴转向速度差限制值[1~24000](单位:mm/min)",	// 8
	"Y轴转向速度差限制值[1~24000](单位:mm/min)",	// 9
	"Z轴转向速度差限制值[1~24000](单位:mm/min)",	// 10
	"直线群圆弧近似速度值[1~24000](单位:mm/min)",	// 11
	"未定义",	// 12
	"",			// 13
	"",			// 14
	"",			// 15
	"",			// 16
	"",			// 17
	"",			// 18
	"",			// 19		
};

INT8S *pPARA_SetupInfo_Arm_CFG_gb[] =
{
	"系统公英制设置",			// 0
	"系统语言设置",				// 1
	"系统颜色设置",				// 2
	"系统数据精度设置[3~5]",	// 3	
	"系统档位模式设置[0~5]",	// 4
	"系统代码模式设置",			// 5
	"系统手轮模式设置",			// 6
	"系统齿轮箱模式设置",		// 7
	"系统键盘蜂鸣器设置",		// 8
	"系统刀补参数映射设置",	// 9	
	"系统升级功能设置",			// 10
	"系统调试功能设置",			// 11
	"系统版本功能设置",			// 12	
	"系统通用参数修改设置",	// 13
	"系统配置参数修改设置",	// 14
	"系统文件系统修改设置",	// 15
	"系统配置参数导入设置",	// 16
	"系统面板类型设置",			// 17
	"系统主电源关机设置",		// 18
	"系统时间设置(2012-01-01 15-19-30)", 	// 19

	"系统参考点搜索功能",			// 20
	"系统参数文件功能",				// 21
	"系统代码校验功能",				// 22
	"系统屏幕保护功能",				// 23
	"系统屏幕抓图功能",				// 24
	"系统配置目录功能",				// 25	
	"系统运行信息截取功能",		// 26	
	"系统运行防护门打开功能",	// 27
	"冷却油输出禁止功能",			// 28
	"文件自动打开功能",				// 29	
	"文件代码显示方式",				// 30	
	"位置界面偏移显示设置",		// 31
	"主轴控制器通讯报警功能",	// 32
	"按键信息记忆功能",				// 33
	"程序条号记忆功能",				// 34
	"程序乱码检测功能",				// 35	
	"程序开始抬刀功能",				// 36
	"程序无换刀指令报警功能",	// 37	
	"程序运行结束提示功能",		// 38	
	"程序文件排序方式设置(1:时间;2:名称;3:大小)",	// 39		
	
	"机床排屑间隔时间(单位:S)",				// 40
	"机床排屑时间(单位:S)",						// 41
	"机床润滑泵润滑间隔时间(单位:S)",  		// 42 
	"机床润滑泵润滑时间(单位:S)", 			// 43 	
	"机床主电源切断延时时间(单位:S)",		// 44
	"未定义",	// 45
	"",	// 46
	"",	// 47
	"",	// 48
	"",	// 49	
	"",	// 50
	"",	// 51
	"",	// 52
	"",	// 53
	"",	// 54
	"",	// 55
	"",	// 56
	"",	// 57
	"",	// 58	
	"机床警告暂停时间(单位:S)",	// 59
	
	"机床刀具卡紧检测",				// 60
	"机床安全门打开检测",			// 61
	"机床电柜门打开检测",			// 62	
	"机床冷却液不足检测",			// 63	
	"机床气压不足检测",				// 64
	"机床电柜温度过高检测",		// 65	
	"机床冷却机报警检测",			// 66
	"机床润滑油油量不足检测",	// 67
	"机床润滑油油压不足检测",	// 68
	"机床参考点限位提示检测",	// 69
	"机床刀具相同检测",				// 70
	"未定义",		// 71
	"",	// 72
	"",	// 73
	"",	// 74
	"",	// 75
	"",	// 76
	"",	// 77
	"",	// 78
	"",	// 79

	"",	// 80
	"",	// 81
	"",	// 82
	"",	// 83
	"",	// 84
	"",	// 85
	"",	// 86	
	"",	// 87
	"",	// 88
	"",	// 89	
	"",	// 90
	"",	// 91
	"",	// 92
	"",	// 93
	"",	// 94
	"",	// 95
	"",	// 96
	"",	// 97
	"",	// 98
	"",	// 99	

	"",	// 100
	"",	// 101
	"",	// 102
	"",	// 103
	"",	// 104
	"",	// 105
	"",	// 106
	"",	// 107
	"",	// 108
	"",	// 109
	"",	// 110
	"",	// 110
	"",	// 112
	"",	// 113
	"",	// 114	
	"",	// 115				
	"",	// 116
	"",	// 117
	"",	// 118
	"",	// 119
	
	"",	// 120
	"",	// 121
	"",	// 122
	"",	// 123
	"",	// 124
	"",	// 125
	"",	// 126
	"",	// 127
	"",	// 128
	"",	// 129
	"",	// 130
	"",	// 131
	"",	// 132
	"",	// 133
	"",	// 134
	"",	// 135
	"",	// 136
	"",	// 137
	"",	// 138
	"",	// 139

	"",	// 140
	"",	// 141
	"",	// 142
	"",	// 143
	"",	// 144
	"",	// 145
	"",	// 146
	"",	// 147
	"",	// 148
	"",	// 149
	"",	// 150
	"",	// 151
	"",	// 152
	"",	// 153
	"",	// 154
	"",	// 155
	"",	// 156
	"",	// 157
	"",	// 158
	"",	// 159

	"",	// 160
	"",	// 161
	"",	// 162
	"",	// 163
	"",	// 164
	"",	// 165
	"",	// 166
	"",	// 167
	"",	// 168
	"",	// 169	
	"",	// 170
	"",	// 171
	"",	// 172
	"",	// 173
	"",	// 174
	"",	// 175
	"",	// 176
	"",	// 177
	"",	// 178
	"",	// 179	

	"",	// 180
	"",	// 181
	"",	// 182
	"",	// 183
	"",	// 184
	"",	// 185
	"",	// 186
	"",	// 187
	"",	// 188
	"",	// 189	
	"",	// 190
	"",	// 191
	"",	// 192
	"",	// 193
	"",	// 194
	"",	// 195
	"",	// 196
	"",	// 197
	"",	// 198
	"",	// 199	

	"",	// 200
	"",	// 201
	"",	// 202
	"",	// 203
	"",	// 204
	"",	// 205
	"",	// 206
	"",	// 207
	"",	// 208
	"",	// 209	
	"",	// 210
	"",	// 211
	"",	// 212
	"",	// 213
	"",	// 214
	"",	// 215
	"",	// 216
	"",	// 217
	"",	// 218
	"",	// 219

	"",	// 220
	"",	// 221
	"",	// 222
	"",	// 223
	"",	// 224
	"",	// 225
	"",	// 226
	"",	// 227
	"",	// 228
	"",	// 229	
	"",	// 230
	"",	// 231
	"",	// 232
	"",	// 233
	"",	// 234
	"",	// 235
	"",	// 236
	"",	// 237
	"",	// 238
	"",	// 239

	"",	// 240
	"",	// 241
	"",	// 242
	"",	// 243
	"",	// 244
	"",	// 245
	"",	// 246
	"",	// 247
	"",	// 248
	"",	// 249	
	"",	// 250
	"",	// 251
	"",	// 252
	"",	// 253
	"",	// 254
	"",	// 255
};

INT8S *pPARA_SetupInfo_Arm_CTRL_gb[] =
{
	"驱动参数修改权限[0~3]",				// 0
	"进给轴控制类型(0-脉冲;1-M2;2-M3)",	// 1
	"主轴控制类型(0-VT;1-M2;2-M3)",			// 2
	"伺服总线从站数量",					// 3
	"自动送料机构电机数量",			// 4
	"IV轴类型选择(0-关闭;1-A;2-B;3-C)",	// 5	
	"V轴类型选择(0-关闭;1-A;2-B;3-C)",	// 6
	"IV轴硬限位功能设置",				// 7
	"V轴硬限位功能设置",				// 8
	"四轴加工类型(0-M200~201切换;1-3+1强制)",				// 9
	"五轴加工类型(0-M200~203切换;1-4+1强制)",				// 10
	"双驱同步轴模型选择(0-无效;1-X轴;2-Y轴;3-Z轴)",		// 11
	"双驱同步轴调试功能(0-无效;1-主动轴 ;2-从动轴)",	// 12
	"伺服刀库控制类型(0-VT;1-M2;2-M3)",		// 13
	"伺服刀库调试功能",						// 14	
	"卡盘调试功能",							// 15
	"主轴配置类型",							// 16
	"主轴连续不通讯次数[2~10]",			// 17
	"主轴连续欠电压误报警次数[10~40]",	// 18	
	"运动轴硬限位检测时间(单位:ms)",	// 19 

	"插补周期[1~100](单位:0.1ms)",				// 20
	"轨迹超程设置(单位:mm)",				// 21
	"曲线平滑允许误差[0~20] (单位:um)",	// 22
	"转角不减速最大角度(单位:度)",		// 23
	"最小速度设定值(单位:0.1mm/s)",		// 24
	"精准最小速度设定值(单位:0.1mm/s)",	// 25
	"转向过程时间常数(单位:ms)",			// 26
	"精准转向过程时间常数(单位:ms)",	// 27	
	"圆弧减速比(G61有效)(单位:0.1)",		// 28
	"圆弧定速计算比例系数[3~12]",			// 29
	"拟合曲线弓高误差[5,50](单位:um)",		// 30
	"拟合曲线公差长度比例因子[10,100]",	// 31	
	"软启动最大速度[15~30]",					// 32
	"软启动比率系数[0~9]",					// 33
	"手动模态速度柔和比例系数[6~10]",	// 34
	"自动模态速度柔和比例系数[6~10]",	// 35
	"电子手轮响应系数[0~10]",				// 36
	"手动功能响应系数[0~10]",				// 37
	"手动功能补偿系数[0~10]",				// 38
	"区域速度计算模式",						// 39	
	
	"功能选择开关1",					// 40
	"功能选择开关2",					// 41
	"功能选择开关3",					// 42
	"功能选择开关4",					// 43
	"功能选择开关5",					// 44
	"功能选择开关6",					// 45	
	"功能选择开关7",					// 46
	"功能选择开关8",					// 47
	"功能选择开关9",					// 48
	"功能选择开关10",					// 49
	"功能选择开关11",					// 50
	"功能选择开关12",					// 51
	"功能选择开关13",					// 52
	"功能选择开关14",					// 53
	"功能选择开关15",					// 54
	"功能选择开关16",					// 55
	"功能选择开关17",					// 56
	"功能选择开关18",					// 57
	"功能选择开关19",					// 58
	"功能选择开关20",					// 59

	"X轴编码器检测标志",			// 60
	"Y轴编码器检测标志",			// 61
	"Z轴编码器检测标志",			// 62
	"IV轴编码器检测标志",			// 63
	"V轴编码器检测标志",			// 64
	"S轴编码器检测标志",			// 65
	"X轴编码器读数方向",			// 66
	"Y轴编码器读数方向",			// 67
	"Z轴编码器读数方向",			// 68
	"IV轴编码器读数方向",			// 69	
	"V轴编码器读数方向",			// 70
	"S轴编码器读数方向",			// 71
	"电子手轮读数方向",				// 72
	"未定义",		// 73
	"未定义",		// 74
	"插补缓冲区模式设置",			// 75
	"插补缓冲区获取设置",			// 76
	"运动轴负载比例设置",			// 77
	"旋转轴负载比例设置",			// 78
	"主轴负载比例设置",				// 79
	
	"搜索参考点方向设置",		// 80
	"手动运动方向设置",			// 81
	"Z轴搜索参考点方向设置",	// 82
	"IV轴搜索参考点方向设置",	// 83
	"V轴搜索参考点方向设置",	// 84
	"X轴手动运动方向设置",		// 85
	"Y轴手动运动方向设置",		// 86
	"Z轴手动运动方向设置",		// 87
	"IV轴手动运动方向设置",	// 88
	"V轴手动运动方向设置",		// 89
	"未定义",	// 90
	"",	// 91
	"",	// 92
	"",	// 93
	"",	// 94
	"",	// 95
	"",	// 96
	"",	// 97
	"",	// 98
	"",	// 99
	
	"X轴非线性补偿组数设置[0~280]",	// 100
	"Y轴非线性补偿组数设置[0~280]",	// 101
	"Z轴非线性补偿组数设置[0~280]",	// 102
	"IV轴非线性补偿组数设置[0~280]",	// 103	
	"V轴非线性补偿组数设置[0~280]",	// 104
	"未定义",	// 105
	"",	// 106
	"",	// 107
	"",	// 108
	"",	// 109	
	"",	// 110
	"",	// 111
	"",	// 112
	"",	// 113
	"",	// 114
	"",	// 115
	"",	// 116	
	"系统轨迹超程报警序号",			// 117
	"系统插补量过大报警序号",		// 118
	"系统加工程式运行条号",			// 119

	"线性轴输入单位(单位:nm)",						// 120
	"旋转轴输入单位(单位:nd)",						// 121
	"主轴输入单位(单位:nd)",							// 122
	"线性轴输出单位(单位:nm/指令单位)",		// 123
	"旋转轴输出单位(单位:nd/指令单位)",		// 124
	"主轴输出单位(单位:nd/指令单位)",			// 125	
	"未定义",	// 126
	"未定义",	// 127
	"X轴反馈编码器分辨率(单位:nm/pulse)",	// 128
	"Y轴反馈编码器分辨率(单位:nm/pulse)",	// 129
	"Z轴反馈编码器分辨率(单位:nm/pulse)",	// 130
	"IV轴反馈编码器每转脉冲数(单位:pulse/r)",	// 131
	"V轴反馈编码器每转脉冲数(单位:pulse/r)",	// 132
	"S轴反馈编码器每转脉冲数(单位:pulse/r)",	// 133
	"X轴间隙补偿(单位:nm)",	// 134
	"Y轴间隙补偿(单位:nm)",	// 135
	"Z轴间隙补偿(单位:nm)",	// 136
	"IV轴间隙补偿(单位:nd)",	// 137
	"V轴间隙补偿(单位:nd)",	// 138
	"S轴间隙补偿(单位:nd)",	// 139

	"线性轴手动一档进给速度设定[100~1000](单位:mm/min)",	// 140
	"线性轴手动二档进给速度设定[1000~5000](单位:mm/min)",	// 141
	"线性轴手动三档进给速度设定[5000~150000](单位:mm/min)",	// 142
	"IV轴手动一档进给速度(单位:degree/s)",				// 143
	"IV轴手动二档进给速度(单位:degree/s)",				// 144
	"IV轴手动三档进给速度(单位:degree/s)",				// 145
	"V轴手动一档进给速度(单位:degree/s)",					// 146
	"V轴手动二档进给速度(单位:degree/s)",					// 147
	"V轴手动三档进给速度(单位:degree/s)",					// 148	
	"线性轴正向搜索参考点速度[10~10000](单位:mm/min)",	// 149
	"线性轴负向搜索参考点速度[10~2000](单位:mm/min)",	// 150
	"线性轴负向搜索参考点距离[10~200](单位:mm)",		// 151
	"IV轴参考点快进速度(单位:degree/s)",					// 152
	"IV轴参考点搜索速度(单位:degree/s)",					// 153
	"IV轴参考点搜索距离(单位:degree)",						// 154
	"V轴参考点快进速度(单位:degree/s)",					// 155	
	"V轴参考点搜索速度(单位:degree/s)",					// 156
	"V轴参考点搜索距离(单位:degree)",						// 157
	"系统最大进给速度(单位:mm/min",						// 158
	"系统限速标志",											// 159
	
	"X轴最大移动速度设置(单位:mm/min)",				// 160
	"Y轴最大移动速度设置(单位:mm/min)",				// 161
	"Z轴最大移动速度设置(单位:mm/min)",				// 162
	"IV轴最大移动速度设置(单位:degree/s)",			// 163
	"V轴最大移动速度设置(单位:degree/s)",				// 164		
	"线性轴快进速度设置[0~200000](单位:mm/min)",	// 165
	"IV轴快进速度设置(单位:degree/s)",					// 166
	"V轴快进速度设置(单位:degree/s)",					// 167
	"线性轴运动平台加速度[0~200000](单位:mm/s2)",	// 168
	"IV轴运动平台加速度设置(单位:degree/s2)",		// 169
	"V轴运动平台加速度设置(单位:degree/s2)",		// 170
	"精准运动平台加速度[0~200000](单位:mm/s2)",		// 171	
	"快进运动平台加速度[0~20000] (单位:mm/ s2)",		// 172
	"精准模态机电时间常数(单位0.1ms)",				// 173	
	"指数型加速机电时间常数(单位0.1ms)",			// 174
	"指数型减速机电时间常数(单位0.1ms)",			// 175	
	"切削加工最大钳制速度(单位:mm/min)",			// 176
	"通用型加速时间常数(单位:0.1ms)",				// 177
	"通用型减速时间常数(单位:0.1ms)",				// 178
	"第二转角不减速最大角度[0~180](单位:度)",		// 179
	
	"二次转角向后搜索距离[0~1000000](单位:um)",		// 180
	"转角指定加速度[1~50000](单位:mm/s2)",				// 181
	"区域速度差值[0~24000](单位:mm/min)",				// 182
	"短区域长度[1~100000](单位:um)",						// 183	
	"短区域加减速度[1~50000](单位:mm/s2)",				// 184
	"长代码长度[1~1000000](单位:um)",						// 185
	"长代码指定角度[0~180](单位:d)",					// 186
	"长代码指定终点速度[0~24000](单位:mm/min)",		// 187
	"长代码指定加速度[1~50000](单位:mm/s2)",			// 188
	"小线段忽略长度值[1~10000](单位:um)",				// 189
	"矢量插补最小线段长度[1~8000](单位:um)",		// 190
	"矢量插补最大线段长度[1~8000](单位:um)",		// 191	
	"伺服主轴钳制转速1(单位:r/min)",					// 192
	"伺服主轴钳制转速2(单位:r/min)",					// 193
	"伺服主轴钳制转速3(单位:r/min)",					// 194
	"伺服主轴钳制转速4(单位:r/min)",					// 195
	"伺服主轴第1段加减速时间常数(单位:0.1ms)",	// 196
	"伺服主轴第2段加减速时间常数(单位:0.1ms)",	// 197
	"伺服主轴第3段加减速时间常数(单位:0.1ms)",	// 198
	"伺服主轴第4段加减速时间常数(单位:0.1ms)",	// 199		

	"主轴减速加速度(单位:r/s2)",			// 200
	"主轴转速设置[0~1000000](单位:r/min)",	// 201
	"主轴定位最低转速[0~100](单位:r/min)",	// 202
	"主轴定位转速(单位:r/min)",				// 203
	"主轴10Hz对应转速当量(r/min)",			// 204
	"刚性攻丝最高主轴转速(单位:r/min)",	// 205
	"刚性攻丝主轴速度采集模式(0-VT总线;1-编码器)",	// 206
	"刚性攻丝主轴停止提前量[0~100](单位:degree)",	// 207
	"刚性攻丝前馈增益Kp[0~225]",					// 208
	"刚性攻丝前馈增益Kv[0~225]",					// 209	
	"双速齿轮箱换挡转速(单位:r/min)",				// 210
	"双速齿轮箱低档最高转速(单位:r/min)",		// 211
	"双速齿轮箱高档最高转速(单位:r/min)",		// 212	
	"双速齿轮箱高低档切换转速(单位:r/min)",	// 213
	"X轴转向速度差限制值[1~24000](单位:mm/min)",	// 214	
	"Y轴转向速度差限制值[1~24000](单位:mm/min)",	// 215
	"Z轴转向速度差限制值[1~24000](单位:mm/min)",	// 216
	"IV轴转向速度差限制值[1~24000](单位:d/min)",	// 217
	"V轴转向速度差限制值[1~24000](单位:d/min)",	// 218
	"直线群圆弧近似速度[1~24000](单位:mm/min)",	// 219	

	"正向软限位X轴坐标(单位:mm)",		// 220
	"正向软限位Y轴坐标(单位:mm)",		// 221
	"正向软限位Z轴坐标(单位:mm)",		// 222
	"正向软限位IV轴坐标(单位:degree)",		// 223
	"正向软限位V轴坐标(单位:degree)",		// 224
	"负向软限位X轴坐标(单位:mm)",		// 225
	"负向软限位Y轴坐标(单位:mm)",		// 226
	"负向软限位Z轴坐标(单位:mm)",		// 227
	"负向软限位IV轴坐标(单位:degree)",		// 228
	"负向软限位V轴坐标(单位:degree)",		// 229
	"参考点位置X轴坐标(单位:mm)",		// 230
	"参考点位置Y轴坐标(单位:mm)",		// 231
	"参考点位置Z轴坐标(单位:mm)",		// 232
	"参考点位置IV轴坐标(单位:degree)",		// 233
	"参考点位置V轴坐标(单位:degree)",		// 234	
	"参考点位置误差(单位:mm)",				// 235				
	"工件卸载X轴机床坐标(单位:mm)",		// 236
	"工件卸载Y轴机床坐标(单位:mm)",		// 237
	"工件卸载Z轴机床坐标(单位:mm)",		// 238
	"双驱同步允许误差(单位:mm)",			// 239
	
	//应该并入到坐标零点模块
	"名义坐标系X轴坐标(单位:mm)",		// 240
	"名义坐标系Y轴坐标(单位:mm)",		// 241
	"名义坐标系Z轴坐标(单位:mm)",		// 242
	"名义坐标系IV轴坐标(单位:degree)",		// 243
	"名义坐标系V轴坐标(单位:degree)",		// 244
	"啄式钻孔返回距离(单位:mm)",			// 245
	"深孔钻孔安全距离(单位:mm)",			// 246
	"镗孔设定角度(单位:degree)",				// 247
	"钻孔底部暂停时间(单位:s)",			// 248
	"未定义",		// 249		
	"",	// 250
	"",	// 251
	"",	// 252
	"",	// 253
	"",	// 254
	"",	// 255	
};

INT8S *pPARA_SetupInfo_Arm_IO_gb[] =
{
	"信号状态设置", 				// 0
	"输入信号状态设置(1-32)", 	// 1		
	"输入信号状态设置(33-64)",	// 2	
	"输出信号状态设置(1-32)",	// 3
	"输出信号状态设置(33-64)",	// 4
	"未定义",	// 5
	"",	// 6
	"",	// 7
	"",	// 8	
	"",	// 9	
	"",	// 10	
	"",	// 11	
	"",	// 12	
	"", 	// 13		
	"",	// 14	
	"",	// 15
	"",	// 16
	"",	// 17
	"",	// 18
	"",	// 19	
	
	"输出自定义设置",	// 20
	"输出引脚01自定义",	// 21
	"输出引脚02自定义",	// 22
	"输出引脚03自定义",	// 23
	"输出引脚04自定义",	// 24
	"输出引脚05自定义",	// 25
	"输出引脚06自定义",	// 26
	"输出引脚07自定义",	// 27
	"输出引脚08自定义",	// 28
	"输出引脚09自定义",	// 29
	"输出引脚10自定义",	// 30
	"输出引脚11自定义",	// 31
	"输出引脚12自定义",	// 32
	"输出引脚13自定义",	// 33
	"输出引脚14自定义",	// 34
	"输出引脚15自定义",	// 35
	"输出引脚16自定义",	// 36
	"输出引脚17自定义",	// 37
	"输出引脚18自定义",	// 38
	"输出引脚19自定义",	// 39

	"输出引脚20自定义",	// 40
	"输出引脚21自定义",	// 41
	"输出引脚22自定义",	// 42
	"输出引脚23自定义",	// 43
	"输出引脚24自定义",	// 44
	"输出引脚25自定义",	// 45
	"输出引脚26自定义",	// 46
	"输出引脚27自定义",	// 47
	"输出引脚28自定义",	// 48
	"输出引脚29自定义",	// 49
	"输出引脚30自定义",	// 50
	"输出引脚31自定义",	// 51
	"输出引脚32自定义",	// 52
	"输出引脚33自定义",	// 53
	"输出引脚34自定义",	// 54
	"输出引脚35自定义",	// 55
	"输出引脚36自定义",	// 56
	"输出引脚37自定义",	// 57
	"输出引脚38自定义",	// 58
	"输出引脚39自定义",	// 59
	
	"输出引脚40自定义",	// 60
	"输出引脚41自定义",	// 61
	"输出引脚42自定义",	// 62
	"输出引脚43自定义",	// 63
	"输出引脚44自定义",	// 64
	"输出引脚45自定义",	// 65
	"输出引脚46自定义",	// 66
	"输出引脚47自定义",	// 67
	"输出引脚48自定义",	// 68
	"输出引脚49自定义",	// 69
	"输出引脚50自定义",	// 70
	"输出引脚51自定义",	// 71
	"输出引脚52自定义",	// 72
	"输出引脚53自定义",	// 73
	"输出引脚54自定义",	// 74
	"输出引脚55自定义",	// 75
	"输出引脚56自定义",	// 76
	"输出引脚57自定义",	// 77
	"输出引脚58自定义",	// 78
	"输出引脚59自定义",	// 79

	"输入自定义设置",	// 80
	"输入引脚01自定义",	// 81
	"输入引脚02自定义",	// 82
	"输入引脚03自定义",	// 83
	"输入引脚04自定义",	// 84
	"输入引脚05自定义",	// 85
	"输入引脚06自定义",	// 86
	"输入引脚07自定义",	// 87
	"输入引脚08自定义",	// 88
	"输入引脚09自定义",	// 89
	"输入引脚10自定义",	// 90
	"输入引脚11自定义",	// 91
	"输入引脚12自定义",	// 92
	"输入引脚13自定义",	// 93
	"输入引脚14自定义",	// 94
	"输入引脚15自定义",	// 95
	"输入引脚16自定义",	// 96
	"输入引脚17自定义",	// 97
	"输入引脚18自定义",	// 98
	"输入引脚19自定义",	// 99

	"输入引脚20自定义",	// 100
	"输入引脚21自定义",	// 101
	"输入引脚22自定义",	// 102
	"输入引脚23自定义",	// 103
	"输入引脚24自定义",	// 104
	"输入引脚25自定义",	// 105
	"输入引脚26自定义",	// 106
	"输入引脚27自定义",	// 107
	"输入引脚28自定义",	// 108
	"输入引脚29自定义",	// 109
	"输入引脚30自定义",	// 110
	"输入引脚31自定义",	// 111
	"输入引脚32自定义",	// 112
	"输入引脚33自定义",	// 113
	"输入引脚34自定义",	// 114
	"输入引脚35自定义",	// 115
	"输入引脚36自定义",	// 116
	"输入引脚37自定义",	// 117
	"输入引脚38自定义",	// 118
	"输入引脚39自定义",	// 111

	"未定义",	// 120
	"",	// 121
	"",	// 122
	"",	// 123
	"",	// 124
	"",	// 125
	"",	// 126
	"",	// 127
	"",	// 128
	"",	// 129	
	"",	// 130
	"",	// 131
	"",	// 132
	"",	// 133
	"",	// 134
	"",	// 135
	"",	// 136
	"",	// 137
	"",	// 138
	"",	// 139
};

INT8S *pPARA_SetupInfo_Arm_Tool_gb[] =
{
	"刀库调试功能设置",						// 0
	"刀库换刀避让设置",						// 1	
	"刀库工位记忆设置",						// 2
	"刀库工位状态设置",						// 3
	"刀库刀具检测设置",						// 10
	"刀库松紧刀检测设置",					// 4
	"刀库防护门控制设置",					// 5
	"刀库主轴信号确认时间设置",		// 6
	"刀库气缸信号确认时间设置",		// 7
	"刀库防护门信号确认时间设置",		// 8
	"刀库工位信号确认时间设置",		// 9
	
	"未定义",	// 11
	"未定义",	// 12	
	"未定义",	// 13
	"未定义",	// 14
	"未定义",	// 15
	"刀库换刀速度设置(单位:mm/min)",			// 16
	"刀库取刀缓冲速度设置(单位:mm/min)",	// 17
	"刀库回刀缓冲速度设置(单位:mm/min)",	// 18
	"刀库换刀缓冲距离设置(单位:mm)",		// 19
	
	
	"刀库回刀缓冲起点坐标(单位:mm)",	// 20
	"刀库回刀缓冲终点坐标(单位:mm)",	// 21
	"刀库取刀缓冲起点坐标(单位:mm)",	// 22
	"刀库取刀缓冲终点坐标(单位:mm)",	// 23
	"刀库安全位置X轴坐标(单位:mm)",		// 24
	"刀库安全位置Y轴坐标(单位:mm)",		// 25
	"刀库换刀避让X轴坐标(单位:mm)",		// 26
	"刀库换刀避让Y轴坐标(单位:mm)",		// 27
	"刀库换刀避让Z轴坐标(单位:mm)",		// 28
	"刀库换刀避让IV轴坐标(单位:mm)",	// 29
	"刀库换刀避让V轴坐标(单位:mm)",		// 30
	"刀库换刀抬刀点坐标(单位:mm)",		// 31
	"刀库主轴定位角度(单位:度)",			// 32	
	"未定义",	// 33
	"",	// 34
	"",	// 35
	"",	// 36
	"",	// 37
	"",	// 38
	"",	// 39


	"排式刀库刀位间距设置(单位:mm)",	// 40
	"排式刀库刀位01位置设置(单位:mm)",	// 41
	"排式刀库刀位02位置设置(单位:mm)",	// 42
	"排式刀库刀位03位置设置(单位:mm)",	// 43
	"排式刀库刀位04位置设置(单位:mm)",	// 44
	"排式刀库刀位05位置设置(单位:mm)",	// 45
	"排式刀库刀位06位置设置(单位:mm)",	// 46
	"排式刀库刀位07位置设置(单位:mm)",	// 47
	"排式刀库刀位08位置设置(单位:mm)",	// 48
	"排式刀库刀位09位置设置(单位:mm)",	// 49
	"排式刀库刀位10位置设置(单位:mm)",	// 50	
	"排式刀库刀位11位置设置(单位:mm)",	// 51
	"排式刀库刀位12位置设置(单位:mm)",	// 52
	"排式刀库刀位13位置设置(单位:mm)",	// 53
	"排式刀库刀位14位置设置(单位:mm)",	// 54
	"排式刀库刀位15位置设置(单位:mm)",	// 55
	"排式刀库刀位16位置设置(单位:mm)",	// 56
	"排式刀库刀位17位置设置(单位:mm)",	// 57
	"排式刀库刀位18位置设置(单位:mm)",	// 58
	"排式刀库刀位19位置设置(单位:mm)",	// 59	

	"伺服刀库参考点角度(单位:度)",	// 60
	"伺服刀库工位01角度(单位:度)",	// 61
	"伺服刀库工位02角度(单位:度)",	// 62
	"伺服刀库工位03角度(单位:度)",	// 63
	"伺服刀库工位04角度(单位:度)",	// 64
	"伺服刀库工位05角度(单位:度)",	// 65
	"伺服刀库工位06角度(单位:度)",	// 66
	"伺服刀库工位07角度(单位:度)",	// 67
	"伺服刀库工位08角度(单位:度)",	// 68
	"伺服刀库工位09角度(单位:度)",	// 69	
	"伺服刀库工位10角度(单位:度)",	// 70
	"伺服刀库工位11角度(单位:度)",	// 71
	"伺服刀库工位12角度(单位:度)",	// 72
	"伺服刀库工位13角度(单位:度)",	// 73
	"伺服刀库工位14角度(单位:度)",	// 74
	"伺服刀库工位15角度(单位:度)",	// 75
	"伺服刀库工位16角度(单位:度)",	// 76
	"伺服刀库工位17角度(单位:度)",	// 77
	"伺服刀库工位18角度(单位:度)",	// 78
	"伺服刀库工位19角度(单位:度)",	// 79

	"未定义",	// 80
	"",	// 81
	"",	// 82
	"",	// 83
	"",	// 84
	"",	// 85
	"",	// 86
	"",	// 87
	"",	// 88
	"",	// 89	
	"",	// 90
	"",	// 91
	"",	// 92
	"",	// 93
	"",	// 94
	"",	// 95
	"",	// 96
	"",	// 97
	"",	// 98
	"",	// 99	

	"",	// 100
	"",	// 101
	"",	// 102
	"",	// 103
	"",	// 104
	"",	// 105
	"",	// 106
	"",	// 107
	"",	// 108
	"",	// 109	
	"",	// 110
	"",	// 111
	"",	// 112
	"",	// 113
	"",	// 114
	"",	// 115
	"",	// 116
	"",	// 117
	"",	// 118
	"",	// 119
};


INT8S *pPARA_SetupInfo_Arm_ATC_gb[] =
{
	"对刀仪长度控制功能",						// 0
	"对刀仪半径控制功能",						// 1
	"对刀仪功能模式[0~1](0-自动;1-手动)",		// 2
	"对刀仪安装模式[1~2](1-X锁定;2-Y锁定)",	// 3
	"对刀仪基准刀设置",							// 4
	"对刀仪重对刀设置",							// 5
	"对刀仪加工状态长度检测功能",			// 6
	"对刀仪加工状态半径检测功能",			// 7
	"对刀仪主轴定位功能",						// 8
	"对刀仪对刀锁定进给速度(单位:mm/min)",	// 9
	"未定义",	// 10
	"",	// 11
	"",	// 12
	"",	// 13
	"",	// 14
	"",	// 15
	"",	// 16
	"",	// 17
	"",	// 18
	"",	// 19

	"对刀仪长度中心X轴坐标(单位:mm)",		// 20
	"对刀仪长度中心Y轴坐标(单位:mm)",		// 22
	"对刀仪半径中心X轴坐标(单位:mm)",		// 22
	"对刀仪半径中心Y轴坐标(单位:mm)",		// 23
	"对刀仪长度检测误差(单位:mm)",				// 24
	"对刀仪半径检测误差(单位:mm)",				// 25
	"对刀仪长度偏移距离(单位:mm)",				// 26
	"对刀仪半径偏移距离(单位:mm)",				// 27
	"对刀仪对刀安全位置Z轴坐标(单位:mm)",	// 28
	"对刀仪对刀减速位置Z轴坐标(单位:mm)",	// 29
	"对刀仪对刀最长刀具长度(单位:mm)",		// 30	
	"对刀仪基准刀具半径(单位:mm)",				// 31
	"未定义",	// 32
	"",	// 33
	"",	// 34
	"",	// 35
	"",	// 36
	"",	// 37
	"",	// 38
	"",	// 39

	"",	// 40
	"",	// 41
	"",	// 42
	"",	// 43
	"",	// 44
	"",	// 45
	"",	// 46
	"",	// 47
	"",	// 48
	"",	// 49
	"",	// 50
	"",	// 51
	"",	// 52
	"",	// 53
	"",	// 54
	"",	// 55
	"",	// 56
	"",	// 57
	"",	// 58
	"",	// 59

	"",	// 60
	"",	// 61
	"",	// 62
	"",	// 63
	"",	// 64
	"",	// 65
	"",	// 66
	"",	// 67
	"",	// 68
	"",	// 69	
	"",	// 70
	"",	// 71
	"",	// 72
	"",	// 73
	"",	// 74
	"",	// 75
	"",	// 76
	"",	// 77
	"",	// 78
	"",	// 79	

	"",	// 80
	"",	// 81
	"",	// 82
	"",	// 83
	"",	// 84
	"",	// 85
	"",	// 86
	"",	// 87
	"",	// 88
	"",	// 89	
	"",	// 90
	"",	// 91
	"",	// 92
	"",	// 93
	"",	// 94
	"",	// 95
	"",	// 96
	"",	// 97
	"",	// 98
	"",	// 99	

	"",	// 100
	"",	// 101
	"",	// 102
	"",	// 103
	"",	// 104
	"",	// 105
	"",	// 106
	"",	// 107
	"",	// 108
	"",	// 109	
	"",	// 110
	"",	// 111
	"",	// 112
	"",	// 113
	"",	// 114
	"",	// 115
	"",	// 116
	"",	// 117
	"",	// 118
	"",	// 119
};

#endif

typedef struct
//typedef __packed struct	
{
	INT32S S001;
	INT32S S002;	
	INT32S S003;
	INT32S S004;
	INT32S S005;
	INT32S S006;
	INT32S S007;
	INT32S S008;
	INT32S S009;
	INT32S S010;
	INT32S S011;
	INT32S S012;
	INT32S S013;
	INT32S S014;
	INT32S S015;
	INT32S S016;
	INT32S S017;
	INT32S S018;
	INT32S S019;
	INT32S S020;
	
	INT32S S021;
	INT32S S022;
	INT32S S023;
	INT32S S024;
	INT32S S025;
	INT32S S026;
	INT32S S027;
	INT32S S028;
	INT32S S029;
	INT32S S030;
	INT32S S031;
	INT32S S032;
	INT32S S033;
	INT32S S034;
	INT32S S035;
	INT32S S036;
	INT32S S037;
	INT32S S038;
	INT32S S039;
	INT32S S040;
	
	INT32S S041;
	INT32S S042;
	INT32S S043;
	INT32S S044;
	INT32S S045;
	INT32S S046;
	INT32S S047;
	INT32S S048;
	INT32S S049;
	INT32S S050;
	INT32S S051;
	INT32S S052;
	INT32S S053;
	INT32S S054;
	INT32S S055;
	INT32S S056;
	INT32S S057;
	INT32S S058;
	INT32S S059;	
	INT32S S060;
	
	INT32S S061;
	INT32S S062;
	INT32S S063;
	INT32S S064;
	INT32S S065;
	INT32S S066;
	INT32S S067;
	INT32S S068;
	INT32S S069;
	INT32S S070;
	INT32S S071;
	INT32S S072;
	INT32S S073;
	INT32S S074;
	INT32S S075;
	INT32S S076;
	INT32S S077;
	INT32S S078;
	INT32S S079;	
	INT32S S080;
	
	INT32S S081;
	INT32S S082;
	INT32S S083;
	INT32S S084;
	INT32S S085;
	INT32S S086;
	INT32S S087;
	INT32S S088;
	INT32S S089;
	INT32S S090;
	INT32S S091;
	INT32S S092;
	INT32S S093;
	INT32S S094;
	INT32S S095;
	INT32S S096;
	INT32S S097;
	INT32S S098;
	INT32S S099;
	INT32S S100;
	
	INT32S S101;
	INT32S S102;
	INT32S S103;
	INT32S S104;
	INT32S S105;
	INT32S S106;
	INT32S S107;
	INT32S S108;
	INT32S S109;
	INT32S S110;
	INT32S S111;
	INT32S S112;
	INT32S S113;
	INT32S S114;
	INT32S S115;
	INT32S S116;
	INT32S S117;
	INT32S S118;
	INT32S S119;
	INT32S S120;
}tsPARASERVO_BUF;

typedef struct
//typedef __packed struct	
{
	INT32S P001;
	INT32S P002;	
	INT32S P003;
	INT32S P004;
	INT32S P005;
	INT32S P006;
	INT32S P007;
	INT32S P008;
	INT32S P009;
	INT32S P010;
	INT32S P011;
	INT32S P012;
	INT32S P013;
	INT32S P014;
	INT32S P015;
	INT32S P016;
	INT32S P017;
	INT32S P018;
	INT32S P019;
	INT32S P020;	
}tsPARAPP_BUF;

typedef struct
//typedef __packed struct
{	
	INT32U CFGDataUnit;		// 0
	INT32U CFGLanguage;		// 1
	INT32U CFGColor;			// 2
	INT32U CFGDataPrecision;	// 3
	INT32U CFGModeGrade;	// 4
	INT32U CFGModeCode;	// 5
	INT32U CFGModeHand;	// 6
	INT32U CFGModeGear;	// 7
	INT32U CFGKeyBeer;		// 8	
	INT32U CFGToolOffset;	// 9
	INT32U CFGSYSUpdate;	// 10
	INT32U CFGSYSDebug;	// 11
	INT32U CFGSYSVersion;	// 12
	INT32U CFGParaCOM;		// 13
	INT32U CFGParaSYS;		// 14
	INT32U CFGParaFile;		// 15	
	INT32U CFGParaInput;		// 16	
	INT32U CFGKeySetup;		// 17
	INT32U CFGPowerOff;		// 18	
	INT32U CFGTime;			// 19
	
	INT32U FunREFEnable;		// 20
	INT32U FunParaFile;		// 21
	INT32U FunCodeCheck;	// 22
	INT32U FunSavSC;		// 23
	INT32U FunPrtSC;			// 24
	INT32U FunSYSDir;		// 25
	INT32U FunRunTrack;		// 26
	INT32U FunDoorSOpen;	// 27
	INT32U FunCoolEnable;	// 28
	INT32U FunFileAutoOpen;	// 29
	INT32U FunFileDisplayType;// 30
	INT32U FunPosOffsetDisplay;	// 31
	INT32U FunKeyInfoSave;		// 33
	INT32U FunProgCountSave;	// 34
	INT32U FunProgErrorCheck;	// 35	
	INT32U FunProgToolRise;		// 36
	INT32U FunProgM06Check;		// 37	
	INT32U FunProgOverWarn;		// 38
	INT32U FunProgSortupType;	// 39

	INT32U TimeChipOff;			// 40
	INT32U TimeChipOn;			// 41
	INT32U TimeLubricateOff;		// 42
	INT32U TimeLubricateOn;		// 43
	INT32U TimePowerOff;		// 44
	INT32U Rsd45;	// 45
	INT32U Rsd46;	// 46
	INT32U Rsd47;	// 47
	INT32U Rsd48;	// 48
	INT32U Rsd49;	// 49
	INT32U Rsd50;	// 50
	INT32U Rsd51;	// 51
	INT32U Rsd52;	// 52
	INT32U Rsd53;	// 53
	INT32U Rsd54;	// 54
	INT32U Rsd55;	// 55
	INT32U Rsd56;	// 56
	INT32S Rsd57;	// 57
	INT32S Rsd58;	// 58
	INT32S TimeWarnHold;		// 59

	INT32U CheckToolSame;	// 60
	INT32U CheckToolState;	// 61 
	INT32U CheckDoorS;		// 62
	INT32U CheckDoorE;		// 63
	INT32U CheckCool;		// 64
	INT32U CheckOil;			// 65
	INT32U CheckGas;		// 66
	INT32U CheckTemp;		// 67
	INT32U CheckCooler;		// 68
	INT32U CheckOilP;		// 69
	INT32U CheckRefLimit;		// 70	
	INT32U Rsd71;	// 71
	INT32U Rsd72;	// 72
	INT32U Rsd73;	// 73
	INT32U Rsd74;	// 74
	INT32U Rsd75;	// 75
	INT32U Rsd76;	// 76
	INT32U Rsd77;	// 77
	INT32U Rsd78;	// 78
	INT32U Rsd79;	// 79	
}	tsPARAARMCFG_BUF;

typedef struct
//typedef __packed struct
{	
	INT32U Tsample;						// 0
	INT32U ServoStationsSub;				// 1
	INT32U TrackRunOutRangeSQR;		// 2
	INT32U a_SET;						// 3
	INT32U a_SET_2;						// 4
	INT32U VeerDeltaV;					// 5	
	INT32U NicetyVeerDeltaV;				// 6
	INT32U VeerDeltaT;					// 7
	INT32U NicetyVeerDeltaT;				// 8
	INT32U REFStopVariable;				// 9
	
	INT32U EncoderCheckAxis;				// 10	
	INT32U RefDirAxis;					// 11
	INT32U AxisUnitInLinear;				// 12
	INT32U AxisUnitOutLinear;				// 13	
	INT32U G0Speed;						// 14
	INT32U G0Speed_2;					// 15
	INT32U G0Speed_Module1;			// 16
	INT32U G0Speed_Module2;			// 17
	INT32U G0Speed_Module3;			// 18
	INT32U G0Speed_Module4;			// 19	

	INT32U G0Speed_Module5;			// 20	
	INT32U G0Speed_Module6;			// 21	
	INT32U G0Speed_Module7;			// 22
	INT32U G0Speed_Module8;			// 23
	INT32U G0Speed_Module9;			// 24
	INT32U G0Speed_Module10;			// 25
	INT32U G0Speed_Module11;			// 26
	INT32U G0Speed_Module12;			// 27
	INT32U G1Speed;						// 28
	INT32U G1Speed_2;					// 29
	
	INT32U G1Speed_Module1;			// 30	
	INT32U G1Speed_Module2;			// 31	
	INT32U G1Speed_Module3;			// 32	
	INT32U G1Speed_Module4;			// 33		
	INT32U G1Speed_Module5;			// 34		
	INT32U G1Speed_Module6;			// 35	
	INT32U G1Speed_Module7;			// 36		
	INT32U G1Speed_Module8;			// 37
	INT32U G1Speed_Module9;			// 38		
	INT32U G1Speed_Module10;			// 39	
	
	INT32U G1Speed_Module11;			// 40		
	INT32U G1Speed_Module12;			// 41
	INT32U SRefSpeed;					// 42
	INT32U SRefSpeedBack;				// 43
	INT32U SRefBack;						// 44
	INT32U SRefSpeed_2;					// 45
	INT32U SRefSpeedBack_2;				// 46
	INT32U SRefBack_2;					// 47
	INT32U Reserved1;					// 48
	INT32U Reserved2;					// 49
		
	INT32U MotorChangeDirAxis1;			// 50
	INT32U MotorChangeDirAxis2;			// 51
	INT32U MotorChangeDirAxis3;			// 52
	INT32U MotorChangeDirAxis4;			// 53
	INT32U MotorChangeDirAxis5;			// 54
	INT32U MotorChangeDirAxis6;			// 55
	INT32U MotorChangeDirAxis7;			// 56
	INT32U MotorChangeDirAxis8;			// 57
	INT32U MotorChangeDirAxis9;			// 58
	INT32U MotorChangeDirAxis10;		// 59	
	INT32U MotorChangeDirAxis11;		// 60 
	INT32U MotorChangeDirAxis12;		// 61	
	INT32U MotorChangeDirAxis13;		// 62
	INT32U MotorChangeDirAxis14;		// 63
	INT32U MotorChangeDirAxis15;		// 64
	INT32U MotorChangeDirAxis16;		// 65
	INT32U MotorChangeDirAxis17;		// 66
	INT32U MotorChangeDirAxis18;		// 67
	INT32U MotorChangeDirAxis19;		// 68
	INT32U MotorChangeDirAxis20;		// 69
	INT32U MotorChangeDirAxis21;		// 70
	INT32U MotorChangeDirAxis22;		// 71
	INT32U MotorChangeDirAxis23;		// 72
	INT32U MotorChangeDirAxis24;		// 73
	INT32U MotorChangeDirAxis25;		// 74
	
	INT32U EncoderRDDir1;		// 75	
	INT32U EncoderRDDir2;		// 76
	INT32U EncoderRDDir3;		// 77
	INT32U EncoderRDDir4;		// 78
	INT32U EncoderRDDir5;		// 79
	INT32U EncoderRDDir6;		// 80
	INT32U EncoderRDDir7;		// 81
	INT32U EncoderRDDir8;		// 82
	INT32U EncoderRDDir9;		// 83
	INT32U EncoderRDDir10;		// 84
	INT32U EncoderRDDir11;		// 85
	INT32U EncoderRDDir12;		// 86
	INT32U EncoderRDDir13;		// 87
	INT32U EncoderRDDir14;		// 88
	INT32U EncoderRDDir15;		// 89	
	INT32U EncoderRDDir16;		// 90
	INT32U EncoderRDDir17;		// 91
	INT32U EncoderRDDir18;		// 92
	INT32U EncoderRDDir19;		// 93
	INT32U EncoderRDDir20;		// 94
	INT32U EncoderRDDir21;		// 95
	INT32U EncoderRDDir22;		// 96
	INT32U EncoderRDDir23;		// 97
	INT32U EncoderRDDir24;		// 98
	INT32U EncoderRDDir25;		// 99

	INT32S AxisResolutionAxis1;		//100
	INT32S AxisResolutionAxis2;		// 101
	INT32S AxisResolutionAxis3;		// 102
	INT32S AxisResolutionAxis4;		// 103
	INT32S AxisResolutionAxis5;		// 104
	INT32U AxisResolutionAxis6;		// 105
	INT32U AxisResolutionAxis7;		// 106
	INT32U AxisResolutionAxis8;		// 107
	INT32U AxisResolutionAxis9;		// 108
	INT32U AxisResolutionAxis10;		// 109
	INT32U AxisResolutionAxis11;		// 110
	INT32U AxisResolutionAxis12;		// 111
	INT32U AxisResolutionAxis13;		// 112
	INT32U AxisResolutionAxis14;		// 113
	INT32U AxisResolutionAxis15;		// 114
	INT32U AxisResolutionAxis16;		// 115
	INT32U AxisResolutionAxis17;		// 116
	INT32U AxisResolutionAxis18;		// 117
	INT32U AxisResolutionAxis19;		// 118
	INT32U AxisResolutionAxis20;		// 119	
	INT32S AxisResolutionAxis21;		// 120
	INT32S AxisResolutionAxis22;		// 121
	INT32S AxisResolutionAxis23;		// 122
	INT32S AxisResolutionAxis24;		// 123
	INT32S AxisResolutionAxis25;		// 124
	
	INT32S CoordORGAxis1;		// 125
	INT32S CoordORGAxis2;		// 126	
	INT32S CoordORGAxis3; 		// 127
	INT32S CoordORGAxis4; 		// 128
	INT32S CoordORGAxis5; 		// 129
	INT32S CoordORGAxis6;		// 130
	INT32S CoordORGAxis7; 		// 131
	INT32S CoordORGAxis8; 		// 132	
	INT32S CoordORGAxis9;		// 133
	INT32S CoordORGAxis10;		// 134	
	INT32S CoordORGAxis11; 		// 135
	INT32S CoordORGAxis12; 		// 136
	INT32S CoordORGAxis13; 		// 137
	INT32S CoordORGAxis14;		// 138
	INT32S CoordORGAxis15;		// 139
	INT32S CoordORGAxis16;		// 140
	INT32S CoordORGAxis17;		// 141
	INT32S CoordORGAxis18;		// 142
	INT32S CoordORGAxis19;		// 143
	INT32S CoordORGAxis20;		// 144
	INT32S CoordORGAxis21;		// 145
	INT32S CoordORGAxis22;		// 146
	INT32S CoordORGAxis23;		// 147	
	INT32S CoordORGAxis24;		// 148
	INT32S CoordORGAxis25;		// 149
		
	//added 20160112
	INT32S CoordOffsetAxis1;
	INT32S CoordOffsetAxis2;
	INT32S CoordOffsetAxis3;
	INT32S CoordOffsetAxis4;
	INT32S CoordOffsetAxis5;
	INT32S CoordOffsetAxis6;
	INT32S CoordOffsetAxis7;
	INT32S CoordOffsetAxis8;
	INT32S CoordOffsetAxis9;
	INT32S CoordOffsetAxis10;
	INT32S CoordOffsetAxis11;
	INT32S CoordOffsetAxis12;
	INT32S CoordOffsetAxis13;
	INT32S CoordOffsetAxis14;
	INT32S CoordOffsetAxis15;
	INT32S CoordOffsetAxis16;
	INT32S CoordOffsetAxis17;
	INT32S CoordOffsetAxis18;
	INT32S CoordOffsetAxis19;
	INT32S CoordOffsetAxis20;
	INT32S CoordOffsetAxis21;
	INT32S CoordOffsetAxis22;
	INT32S CoordOffsetAxis23;
	INT32S CoordOffsetAxis24;
	INT32S CoordOffsetAxis25;

	INT32S CoordSafeAxis1;
	INT32S CoordSafeAxis2;
	INT32S CoordSafeAxis3;
	INT32S CoordSafeAxis4;
	INT32S CoordSafeAxis5;
	INT32S CoordSafeAxis6;
	INT32S CoordSafeAxis7;
	INT32S CoordSafeAxis8;
	INT32S CoordSafeAxis9;
	INT32S CoordSafeAxis10;
	INT32S CoordSafeAxis11;
	INT32S CoordSafeAxis12;
	INT32S CoordSafeAxis13;
	INT32S CoordSafeAxis14;
	INT32S CoordSafeAxis15;
	INT32S CoordSafeAxis16;
	INT32S CoordSafeAxis17;
	INT32S CoordSafeAxis18;
	INT32S CoordSafeAxis19;
	INT32S CoordSafeAxis20;
	INT32S CoordSafeAxis21;
	INT32S CoordSafeAxis22;
	INT32S CoordSafeAxis23;
	INT32S CoordSafeAxis24;
	INT32S CoordSafeAxis25;

	INT32S CoordBackAxis1;
	INT32S CoordBackAxis2;
	INT32S CoordBackAxis3;
	INT32S CoordBackAxis4;
	INT32S CoordBackAxis5;
	INT32S CoordBackAxis6;
	INT32S CoordBackAxis7;
	INT32S CoordBackAxis8;
	INT32S CoordBackAxis9;
	INT32S CoordBackAxis10;
	INT32S CoordBackAxis11;
	INT32S CoordBackAxis12;
	INT32S CoordBackAxis13;
	INT32S CoordBackAxis14;
	INT32S CoordBackAxis15;
	INT32S CoordBackAxis16;
	INT32S CoordBackAxis17;
	INT32S CoordBackAxis18;
	INT32S CoordBackAxis19;
	INT32S CoordBackAxis20;
	INT32S CoordBackAxis21;
	INT32S CoordBackAxis22;
	INT32S CoordBackAxis23;
	INT32S CoordBackAxis24;
	INT32S CoordBackAxis25;

	INT32S PositionCoordinate1Axis1;		
	INT32S PositionCoordinate1Axis2;		
	INT32S PositionCoordinate1Axis3;		
	INT32S PositionCoordinate1Axis4;		
	INT32S PositionCoordinate1Axis5;		
	INT32S PositionCoordinate1Axis6;		
	INT32S PositionCoordinate1Axis7;		
	INT32S PositionCoordinate1Axis8;		
	INT32S PositionCoordinate1Axis9;		
	INT32S PositionCoordinate1Axis10;		
	INT32S PositionCoordinate1Axis11;		
	INT32S PositionCoordinate1Axis12;		
	INT32S PositionCoordinate1Axis13;		
	INT32S PositionCoordinate1Axis14;		
	INT32S PositionCoordinate1Axis15;		
	INT32S PositionCoordinate1Axis16;		
	INT32S PositionCoordinate1Axis17;		
	INT32S PositionCoordinate1Axis18;		
	INT32S PositionCoordinate1Axis19;		
	INT32S PositionCoordinate1Axis20;		
	INT32S PositionCoordinate1Axis21;		
	INT32S PositionCoordinate1Axis22;		
	INT32S PositionCoordinate1Axis23;		
	INT32S PositionCoordinate1Axis24;		
	INT32S PositionCoordinate1Axis25;		

	INT32S PositionCoordinate2Axis1;		
	INT32S PositionCoordinate2Axis2;		
	INT32S PositionCoordinate2Axis3; 		
	INT32S PositionCoordinate2Axis4; 		
	INT32S PositionCoordinate2Axis5; 		
	INT32S PositionCoordinate2Axis6;		
	INT32S PositionCoordinate2Axis7; 		
	INT32S PositionCoordinate2Axis8; 		
	INT32S PositionCoordinate2Axis9;		
	INT32S PositionCoordinate2Axis10;		
	INT32S PositionCoordinate2Axis11; 	
	INT32S PositionCoordinate2Axis12; 	
	INT32S PositionCoordinate2Axis13; 	
	INT32S PositionCoordinate2Axis14;		
	INT32S PositionCoordinate2Axis15;		
	INT32S PositionCoordinate2Axis16;		
	INT32S PositionCoordinate2Axis17;		
	INT32S PositionCoordinate2Axis18;		
	INT32S PositionCoordinate2Axis19;		
	INT32S PositionCoordinate2Axis20;		
	INT32S PositionCoordinate2Axis21;		
	INT32S PositionCoordinate2Axis22;		
	INT32S PositionCoordinate2Axis23;		
	INT32S PositionCoordinate2Axis24;		
	INT32S PositionCoordinate2Axis25;		
	
	INT32S FeedMaxAxis1;			// 150
	INT32S FeedMaxAxis2;			// 151
	INT32S FeedMaxAxis3;			// 152
	INT32S FeedMaxAxis4;			// 153
	INT32S FeedMaxAxis5;			// 154
	INT32S FeedMaxAxis6;			// 155
	INT32S FeedMaxAxis7;			// 156	
	INT32S FeedMaxAxis8;			// 157
	INT32S FeedMaxAxis9;			// 158		
	INT32S FeedMaxAxis10;			// 159
	INT32S FeedMaxAxis11;			// 160
	INT32S FeedMaxAxis12;			// 161
	INT32S FeedMaxAxis13;			// 162
	INT32S FeedMaxAxis14;			// 163
	INT32S FeedMaxAxis15;			// 164
	INT32S FeedMaxAxis16;			// 165
	INT32S FeedMaxAxis17;			// 166
	INT32S FeedMaxAxis18;			// 167
	INT32S FeedMaxAxis19;			// 168
	INT32S FeedMaxAxis20;			// 169
	INT32S FeedMaxAxis21;			// 170
	INT32S FeedMaxAxis22;			// 171
	INT32S FeedMaxAxis23;			// 172
	INT32S FeedMaxAxis24;			//173
	INT32S FeedMaxAxis25; 			//174
	
	INT32S REFStopAxis1; 			//175
	INT32S REFStopAxis2; 			//176
	INT32S REFStopAxis3; 			//177
	INT32S REFStopAxis4; 			//178		
	INT32S REFStopAxis5;				//179
	INT32S REFStopAxis6;		    		// 180
	INT32S REFStopAxis7;				// 181
	INT32S REFStopAxis8;				// 182
	INT32S REFStopAxis9;	    			// 183
	INT32S REFStopAxis10;	       	// 184
	INT32S REFStopAxis11;	    		// 185
	INT32S REFStopAxis12;	        	// 186
	INT32S REFStopAxis13;	        	// 187
	INT32S REFStopAxis14;	    		// 188
	INT32S REFStopAxis15;			// 189
	INT32S REFStopAxis16;			// 190	
	INT32S REFStopAxis17;			// 191
	INT32S REFStopAxis18;			// 192
	INT32S REFStopAxis19;			// 193
	INT32S REFStopAxis20;			// 194 
	INT32S REFStopAxis21;	    		// 195
	INT32S REFStopAxis22;	        	// 196
	INT32S REFStopAxis23;	        	// 197
	INT32S REFStopAxis24;	    		// 198
	INT32S REFStopAxis25;			// 199

	INT32S SLimitPosAxis1;			// 200
	INT32S SLimitPosAxis2;			// 201	
	INT32S SLimitPosAxis3;			// 202
	INT32S SLimitPosAxis4;			// 203
	INT32S SLimitPosAxis5;			// 204 
	INT32S SLimitPosAxis6;			// 205
	INT32S SLimitPosAxis7;			// 206	
	INT32S SLimitPosAxis8;			// 207
	INT32S SLimitPosAxis9;			// 208
	INT32S SLimitPosAxis10;			// 209 
	INT32S SLimitPosAxis11;			// 210
	INT32S SLimitPosAxis12;			// 211
	INT32S SLimitPosAxis13;			// 212
	INT32S SLimitPosAxis14;			// 213 
	INT32S SLimitPosAxis15;			// 214
	INT32S SLimitPosAxis16;			// 215
	INT32S SLimitPosAxis17;			// 216
	INT32S SLimitPosAxis18;			// 217
	INT32S SLimitPosAxis19;			// 218
	INT32S SLimitPosAxis20;			// 219	
	INT32S SLimitPosAxis21;			// 220	
	INT32S SLimitPosAxis22;			// 221
	INT32S SLimitPosAxis23;			// 222
	INT32S SLimitPosAxis24;			// 223
	INT32S SLimitPosAxis25;			// 224

	INT32S SLimitNegAxis1;			// 225
	INT32S SLimitNegAxis2;			// 226
	INT32S SLimitNegAxis3;			// 227
	INT32S SLimitNegAxis4;			// 228
	INT32S SLimitNegAxis5;			// 229
	INT32S SLimitNegAxis6;			// 230
	INT32S SLimitNegAxis7;			// 231
	INT32S SLimitNegAxis8;			// 232
	INT32S SLimitNegAxis9;			// 233
	INT32S SLimitNegAxis10;			// 234
	INT32S SLimitNegAxis11;			// 235	
	INT32S SLimitNegAxis12;			// 236
	INT32S SLimitNegAxis13;			// 237
	INT32S SLimitNegAxis14;			// 238	
	INT32S SLimitNegAxis15;			// 239	
	INT32S SLimitNegAxis16;			// 240
	INT32S SLimitNegAxis17;			// 241
	INT32S SLimitNegAxis18;			// 242
	INT32S SLimitNegAxis19;			// 243
	INT32S SLimitNegAxis20;			// 244
	INT32S SLimitNegAxis21;			// 245
	INT32S SLimitNegAxis22;			// 246
	INT32S SLimitNegAxis23;			// 247
	INT32S SLimitNegAxis24;			// 248
	INT32S SLimitNegAxis25;			// 249
									
	INT32U FunctionSelect01;			// 250	
	INT32U FunctionSelect02;			// 251	
	INT32U FunctionSelect03;			// 252	
	INT32U FunctionSelect04;			// 253	
	INT32U FunctionSelect05;			// 254	
	INT32U FunctionSelect06;			// 255	
	INT32U FunctionSelect07;			// 256		
	INT32U FunctionSelect08;			// 257		
	INT32U FunctionSelect09;			// 258		
	INT32U FunctionSelect10;			// 259		

	INT32U  LEDFlashTime1;
	INT32U  LEDFlashTime2;
	
	INT32U	Reserved3;				// 260
	INT32U	Reserved4;				// 261
	INT32U	Reserved5;				// 262
	INT32U	Reserved6;				// 263
	INT32U	Reserved7;				// 264
	INT32U	Reserved8;				// 265
	INT32U	Reserved9;				// 266
	INT32U	Reserved10;				// 267
	INT32U	Reserved11;				// 268
	INT32U	Reserved12;				// 269

	INT32U PacketCheckCode_B1;

	#if 0
	INT32U ServoParaModify;		// 0
	INT32U ServoFeedType;		// 1
	INT32U ServoSpinType;		// 2
	INT32U ServoStationsSub;		// 3
	INT32U ServoStationsAuto;		// 4	
	INT32U AxisTypeIV;			// 5
	INT32U AxisTypeV;			// 6
	INT32U AxisHLimitIV;			// 7
	INT32U AxisHLimitV;			// 8
	INT32U AxisAutoCtrlIV;		// 9
	INT32U AxisAtuoCtrlV;			// 10
	INT32U AxisDualCtrlType;		// 11
	INT32U AxisDualCtrlDebug;		// 12
	INT32U ServoToolLibType;		// 13
	INT32U ServoToolLibDebug;	// 14
	INT32U ServoRotateDebug;	// 15
	INT32U AxisHlimitTimes;		// 19	

	INT32U InterpolationCycle;		// 20
	INT32U TrackOverflow;		// 21
	INT32U CurveSmoothOffset;	// 22
	INT32U TurnNoDecAngle;		// 23
	INT32U FeedMin;				// 24
	INT32U FeedMinNice;			// 25
	INT32U TimeConstTurn;		// 26
	INT32U TimeConstTurnNice;	// 27	
	INT32U ArcDecRatio;			// 28
	INT32U ArcCalculateScale;		// 29
	INT32U FittingLineOffset;		// 30 
	INT32U FittingLineScale;		// 31
	INT32U SoftBootFeed;			// 32
	INT32U SoftBootScale;			// 33
	INT32U SoftFeedScaleJog;		// 34
	INT32U SoftFeedScaleAuto;	// 35
	INT32U ResponseScaleHand;	// 36
	INT32U ResponseScaleJog;		// 37
	INT32U OffsetScaleJog;		// 38
	INT32U AreaFeedDealType;	// 39

	INT32U FunctionSelect01;		// 40
	INT32U FunctionSelect02;		// 41
	INT32U FunctionSelect03;		// 42
	INT32U FunctionSelect04;		// 43
	INT32U FunctionSelect05;		// 44
	INT32U FunctionSelect06;		// 45
	INT32U FunctionSelect07;		// 46
	INT32U FunctionSelect08;		// 47
	INT32U FunctionSelect09;		// 48
	INT32U FunctionSelect10;		// 49
	INT32U FunctionSelect11;		// 50
	INT32U FunctionSelect12;		// 51
	INT32U FunctionSelect13;		// 52
	INT32U FunctionSelect14;		// 53
	INT32U FunctionSelect15;		// 54
	INT32U FunctionSelect16;		// 55
	INT32U FunctionSelect17;		// 56
	INT32U FunctionSelect18;		// 57
	INT32U FunctionSelect19;		// 58
	INT32U FunctionSelect20;		// 59
	
	INT32U EncoderCheckX;		// 60 
	INT32U EncoderCheckY;		// 61	
	INT32U EncoderCheckZ;		// 62
	INT32U EncoderCheckIV;		// 63
	INT32U EncoderCheckV;		// 64
	INT32U EncoderCheckS;		// 65
	INT32U EncoderRDDirX;		// 66
	INT32U EncoderRDDirY;		// 67
	INT32U EncoderRDDirZ;		// 68
	INT32U EncoderRDDirIV;		// 69
	INT32U EncoderRDDirV;		// 70
	INT32U EncoderRDDirS;		// 71
	INT32U EncoderRDDirHand;	// 72
	INT32U Rsd73;	// 73
	INT32U Rsd74;	// 74
	INT32U InterpolateMode;		// 75
	INT32U InterpolateCatch;		// 76
	INT32U AxisLoadAxis8caleL;		// 77
	INT32U AxisLoadAxis8caleR;		// 78
	INT32U AxisLoadAxis8caleS;		// 79

	INT32U RefDirX;		// 80
	INT32U RefDirY;		// 81
	INT32U RefDirZ;		// 82
	INT32U RefDirIV;		// 83
	INT32U RefDirV;		// 84
	INT32U JogDirX;		// 85
	INT32U JogDirY;		// 86
	INT32U JogDirZ;		// 87
	INT32U JogDirIV;		// 88
	INT32U JogDirV;		// 89	
	INT32U Rsd90;		// 90
	INT32U Rsd91;		// 91
	INT32U Rsd92;		// 92
	INT32U Rsd93;		// 93
	INT32U Rsd94;		// 94
	INT32U Rsd95;		// 95
	INT32U Rsd96;		// 96
	INT32U Rsd97;		// 97
	INT32U Rsd98;		// 98
	INT32U Rsd99;		// 99

	INT32S LinearOffsetCountX;	//100
	INT32S LinearOffsetCountY;	// 101
	INT32S LinearOffsetCountZ;	// 102
	INT32S LinearOffsetCountIV;	// 103
	INT32S LinearOffsetCountV;	// 104
	INT32U Rsd105;	// 105
	INT32U Rsd106;	// 106
	INT32U Rsd107;	// 107
	INT32U Rsd108;	// 108
	INT32U Rsd109;	// 109
	INT32U Rsd110;	// 110
	INT32U Rsd111;	// 111
	INT32U Rsd112;	// 112
	INT32U Rsd113;	// 113
	INT32U Rsd114;	// 114
	INT32U Rsd115;	// 115
	INT32U Rsd116;	// 116
	INT32U ProgOvertrackID;		// 117
	INT32U ProgInterpolateID;		// 118
	INT32U ProgRunCountID;		// 119
	
	INT32S AxisUnitInLinear;		// 120
	INT32S AxisUnitInRotate;		// 121
	INT32S AxisUnitOutLinear;		// 123
	INT32S AxisUnitOutRotate;		// 124
	INT32S Rsd126;	// 126
	INT32S Rsd127;	// 127	
	INT32S AxisResolutionX; 		// 128
	INT32S AxisResolutionY; 		// 129
	INT32S AxisResolutionZ; 		// 130
	INT32S AxisResolutionIV;		// 131
	INT32S AxisResolutionV; 		// 132
	INT32S AxisResolutionS; 		// 133
	
	INT32S FeedLJogGrade1;		// 140
	INT32S FeedLJogGrade2;		// 141
	INT32S FeedLJogGrade3;		// 142
	INT32S FeedIVJogGrade1;		// 143
	INT32S FeedIVJogGrade2;		// 144
	INT32S FeedIVJogGrade3;		// 145
	INT32S FeedVJogGrade1;		// 146
	INT32S FeedVJogGrade2;		// 147
	INT32S FeedVJogGrade3;		// 148	
	INT32S FeedLRefPos;			// 149
	INT32S FeedLRefNeg;			// 150
	INT32S DistLRefNeg;			// 151
	INT32S FeedIVRefPos;			// 152
	INT32S FeedIVRefNeg;		// 153
	INT32S DistIVRefNeg;			// 154
	INT32S FeedVRefPos;			// 155
	INT32S FeedVRefNeg;			// 156
	INT32S DistVRefNeg;			// 157	
	INT32S FeedLMax;			// 158
	INT32S FeelLLimitSign;			// 159		

	INT32S FeedMaxX;			// 160
	INT32S FeedMaxY;			// 161
	INT32S FeedMaxZ;			// 162
	INT32S FeedMaxIV;			// 163
	INT32S FeedMaxV;			// 164
	INT32S FeedG0L;				// 165
	INT32S FeedG0IV;				// 166
	INT32S FeedG0V;				// 167
	INT32S AccFeedL;				// 168
	INT32S AccFeedIV;			// 169
	INT32S AccFeedV;				// 170
	INT32S AccFeedNice;			// 171
	INT32S AccFeedG0;			// 172
	INT32S TimeConstExponentNice;	//173
	INT32S TimeConstExponentAcc;		//174
	INT32S TimeConstExponentDec; 	//175
	INT32S STDFeedClamp; 			//176
	INT32S TimeConstCombineAcc; 		//177
	INT32S TimeConstCombineDec; 	//178
	INT32S TurnNoDecAngle2; 			//179		

	INT32S Veer2_SearchLen;		// 180
	INT32S VeerDecA;		    		// 181
	INT32S NCAreaSpeedRange;	// 182
	INT32S NCAreashortLen;		// 183
	INT32S NCAreashortA;	    		// 184
	INT32S LongCodeLen;	       	// 185
	INT32S LongCodeAngle;	    	// 186
	INT32S LongCodeVm;	        	// 187
	INT32S LongCodeA;	        	// 188
	INT32S Min_CodeStotal;	    	// 189
	INT32S VecterInerpolate_MinLen;	// 190
	INT32S VecterInerpolate_MaxLen;	// 191	
	INT32S SpeedClamp1;			// 192
	INT32S SpeedClamp2;			// 193
	INT32S SpeedClamp3;			// 194 
	INT32S SpeedClamp4;			// 195
	INT32S TurnFeedLimitX;		// 214
	INT32S TurnFeedLimitY;		// 215
	INT32S TurnFeedLimitZ;		// 216
	INT32S TurnFeedLimitIV;		// 217
	INT32S TurnFeedLimitV;		// 218
	INT32S LineToArcFeed;		// 219	

	INT32S SLimitPosX;		// 220	
	INT32S SLimitPosY;		// 221
	INT32S SLimitPosZ;		// 222
	INT32S SLimitPosIV;		// 223
	INT32S SLimitPosV;		// 224
	INT32S SLimitNegX;		// 225
	INT32S SLimitNegY;		// 226
	INT32S SLimitNegZ;		// 227
	INT32S SLimitNegIV;		// 228
	INT32S SLimitNegV;		// 229
	INT32S REFStopX;			// 230
	INT32S REFStopY;			// 231
	INT32S REFStopZ;			// 232
	INT32S REFStopIV;		// 233
	INT32S REFStopV;			// 234
	INT32S REFStopVariable;	// 235	
	INT32S PartSafeX;		// 236
	INT32S PartSafeY;		// 237
	INT32S PartSafeZ;		// 238
	INT32S DualAxisOffset;	// 239
		
	INT32S CoordORGX;			// 240
	INT32S CoordORGY;			// 241
	INT32S CoordORGZ;			// 242
	INT32S CoordORGIV;			// 243
	INT32S CoordORGV;			// 244
	INT32S G73BackLength;		// 245
	INT32S G83SafeLength;		// 246
	INT32S G76SetupAngle;		// 247
	INT32S DrillPauseTime;		// 248
	INT32S Rsd249;				// 249
	INT32S Rsd250;				// 250
	INT32S Rsd251;				// 251
	INT32S Rsd252;				// 252
	INT32S Rsd253;				// 253
	INT32S Rsd254;				// 254
	INT32S Rsd255;				// 255
	#endif
}tsPARAARMCTRL_BUF;

typedef struct
//typedef __packed struct
{	
	INT32U SignSetup;		// 0
	INT32U SignIn1_32;		// 1
	INT32U SignIn33_64;		// 2
	INT32U SignOut1_32;		// 3
	INT32U SignOut33_64;		// 4
	INT32U SignRsd6;			// 5
	INT32U SignRsd7;			// 6
	INT32U SignRsd8;			// 7
	INT32U SignRsd9;			// 8
	INT32U SignRsd10;		// 9
	INT32U SignRsd11;		// 10
	INT32U SignRsd12;		// 11
	INT32U SignRsd13;		// 12
	INT32U SignRsd14;		// 13
	INT32U SignRsd15;		// 14
	INT32U SignRsd16;		// 15
	INT32U SignRsd17;		// 16
	INT32U SignRsd18;		// 17
	INT32U SignRsd19;		// 18
	INT32U SignRsd20;		// 19

	INT32U OutSetup;			// 20
	INT32U OutPin[59];		// 21

	INT32U InSetup;			// 80
	INT32U InPin[59];			// 81
}tsPARAARMIO_BUF;
	
typedef struct
//typedef __packed struct
{	
	INT32S ToolFunBebug;		// 0
	INT32S ToolFunSafe;		// 1
	INT32S ToolTurnSave;		// 2
	INT32S ToolTurnState;		// 3
	INT32S ToolSpinCheck;	// 4
	INT32S ToolDoorCtrl;		// 5
	INT32S ToolSpinSign;		// 6
	INT32S ToolGasSign;		// 7
	INT32S ToolDoorSign;		// 8
	INT32S ToolTurnSign;		// 9
	INT32S ToolFeedChg;		// 10
	INT32S ToolFeedGet;		// 11
	INT32S ToolFeedBack;		// 12
	INT32S ToolDistChg;		// 13
	INT32S ToolSignCHeck;	// 14
	INT32S Rsd15;			// 15
	INT32S Rsd16;			// 16
	INT32S Rsd17;			// 17
	INT32S Rsd18;			// 18
	INT32S ToolRefAngleSign;	// 19
	
	INT32S ToolPosBackStart;	// 20
	INT32S ToolPosBackEnd;	// 21
	INT32S ToolPosGetStart;	// 22
	INT32S ToolPosGetEnd;	// 23
	INT32S ToolPosSafeX;		// 24
	INT32S ToolPosSafeY;		// 25
	INT32S ToolPosChgX;		// 26
	INT32S ToolPosChgY;		// 27
	INT32S ToolPosChgZ;		// 28
	INT32S ToolPosChgIV;		// 29
	INT32S ToolPosChgV;		// 30
	INT32S ToolPosRiseZ;		// 31
	INT32S ToolSpinAngle;		// 32
	INT32S Rsd33;			// 33
	INT32S Rsd34;			// 34
	INT32S Rsd35;			// 35
	INT32S Rsd36;			// 36
	INT32S Rsd37;			// 37
	INT32S Rsd38;			// 38
	INT32S Rsd39;			// 39
}tsPARAARMTOOL_BUF;

typedef struct
//typedef __packed struct
{	
	INT32S ATCCtrlLen;		// 0
	INT32S ATCCtrlRad;		// 1
	INT32S ATCModeFun;		// 2
	INT32S ATCModeSetup;	// 3
	INT32S ATCToolSTD;		// 4
	INT32S ATCToolRPT;		// 5
	INT32S ATCCheckLen;		// 6
	INT32S ATCCheckRad;		// 7  
	INT32S ATCSpinLocate;	// 8
	INT32S ATCFeedLock;		// 9
	INT32S Rsd10;			// 10
	INT32S Rsd11;			// 11
	INT32S Rsd12;			// 12
	INT32S Rsd13;			// 13
	INT32S Rsd14;			// 14
	INT32S Rsd15;			// 15
	INT32S Rsd16;			// 16
	INT32S Rsd17;			// 17
	INT32S Rsd18;			// 18
	INT32S Rsd19;			// 19
	
	INT32S ATCPosLenCX;		//20
	INT32S ATCPosLenCY;		//21
	INT32S ATCPosRadCX;		//22
	INT32S ATCPosRadCY;		//23
	INT32S ATCToleranceLen;	//24
	INT32S ATCToleranceRad;	//25
	INT32S ATCOffsetLen;		//26
	INT32S ATCOffsetRad;		//27
	INT32S ATCPosSafeZ;		//28
	INT32S ATCPosDecZ;		//29
	INT32S ATCToolLenMax;	//30
	INT32S ATCToolSTDRad;	//31
}tsPARAARMATC_BUF;

typedef struct
//typedef __packed struct
{
	INT32S Type;		// 00
	INT32S Total;		// 01
	INT32S Now;		// 02
	INT32S Turn[120];	// 03
}tsPARATOOLLIB_BUF;

typedef struct
//typedef __packed struct
{
	INT32S Gap;			// 00
	INT32S Turn[120];		// 01
}tsPARATOOLPOS_BUF;

typedef struct
//typedef __packed struct
{
	INT32S Ref;		// 00
	INT32S Turn[120];	// 01
}tsPARATOOLANGLE_BUF;


#endif
